       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloYuki.
      *-------------------------
       PROCEDURE DIVISION.
           DISPLAY "Hello, Yuki!".
           STOP RUN.